app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "asdas"], ["user_id", 1], ["created_at", 2017-03-26 10:22:50 UTC], ["updated_at", 2017-03-26 10:22:50 UTC]]
---
  def create
    message = current_user.messages.build(message_params)
    if message.save